export default {
    state: {
        "tests": [
            {
                "name": "Как хорошо ты знаешь Машу?",
                "id": "1",
                "questions": [
                    {
                        "question": "Машин любимый цвет",
                        "id": "1",
                        "answers": [
                            {
                                "answer": "Желтый",
                                "id": "1",
                                "balls": "10"
                            },
                            {
                                "answer": "Зелёный",
                                "id": "2",
                                "balls": "0"
                            },
                            {
                                "answer": "Розовый",
                                "id": "3",
                                "balls": "0"
                            },
                            {
                                "answer": "Фиолетовый",
                                "id": "4",
                                "balls": "5"
                            }
                        ]
                    },
                    {
                        "question": "Машино любимое время года",
                        "id": "2",
                        "answers": [
                            {
                                "answer": "Зима",
                                "id": "1",
                                "balls": "0"
                            },
                            {
                                "answer": "Весна",
                                "id": "2",
                                "balls": "0"
                            },
                            {
                                "answer": "Лето",
                                "id": "3",
                                "balls": "10"
                            },
                            {
                                "answer": "Осень",
                                "id": "4",
                                "balls": "5"
                            }
                        ]
                    },
                    {
                        "question": "Машин любимый сериал",
                        "id": "3",
                        "answers": [
                            {
                                "answer": "Сверхъестественное ",
                                "id": "1",
                                "balls": "2"
                            },
                            {
                                "answer": "Сплетница",
                                "id": "2",
                                "balls": "10"
                            },
                            {
                                "answer": "Почему женщины убивают",
                                "id": "3",
                                "balls": "2"
                            },
                            {
                                "answer": "Майли Сайрус",
                                "id": "4",
                                "balls": "0"
                            }
                        ]
                    },
                    {
                        "question": "Машин любимый фастфуд",
                        "id": "4",
                        "answers": [
                            {
                                "answer": "Не люблю фастфуд",
                                "id": "1",
                                "balls": "0"
                            },
                            {
                                "answer": "McDonald’s",
                                "id": "2",
                                "balls": "10"
                            },
                            {
                                "answer": "KFC",
                                "id": "3",
                                "balls": "0"
                            },
                            {
                                "answer": "Пузата хата",
                                "id": "4",
                                "balls": "2"
                            }
                        ]
                    },
                    {
                        "question": "Машин любимый напиток",
                        "id": "5",
                        "answers": [
                            {
                                "answer": " Вода",
                                "id": "1",
                                "balls": "0"
                            },
                            {
                                "answer": "Мартинт",
                                "id": "2",
                                "balls": "3"
                            },
                            {
                                "answer": "Джин тоник",
                                "id": "3",
                                "balls": "10"
                            },
                            {
                                "answer": "Кофе",
                                "id": "4",
                                "balls": "0"
                            }
                        ]
                    },
                    {
                        "question": "Как Маша предпочла бы провести вечер?",
                        "id": "6",
                        "answers": [
                            {
                                "answer": "Дома смотреть сериал одной",
                                "id": "1",
                                "balls": "0"
                            },
                            {
                                "answer": "Сходить в ресторан с любимым",
                                "id": "2",
                                "balls": "3"
                            },
                            {
                                "answer": "Пойти в караоке с друзьями",
                                "id": "3",
                                "balls": "10"
                            },
                            {
                                "answer": "Спать",
                                "id": "4",
                                "balls": "2"
                            }
                        ]
                    },
                    {
                        "question": "Какую супер способность Маша хотела бы?",
                        "id": "7",
                        "answers": [
                            {
                                "answer": "Невидимость",
                                "id": "1",
                                "balls": "0"
                            },
                            {
                                "answer": "Летать",
                                "id": "2",
                                "balls": "2"
                            },
                            {
                                "answer": "Читать мысли",
                                "id": "3",
                                "balls": "10"
                            },
                            {
                                "answer": "Теликинез",
                                "id": "4",
                                "balls": "3"
                            }
                        ]
                    },
                    {
                        "question": "От чего Маша точно не откажется с тобой?",
                        "id": "8",
                        "answers": [
                            {
                                "answer": "Заказать еды и пить сидрик",
                                "id": "1",
                                "balls": "5"
                            },
                            {
                                "answer": "Заняться вместе утренним пробежками",
                                "id": "2",
                                "balls": "2"
                            },
                            {
                                "answer": "Нарядиться и пойти покарять бары города",
                                "id": "3",
                                "balls": "10"
                            },
                            {
                                "answer": "Я во всем тебе откажу, я похожа на общительного человека?",
                                "id": "4",
                                "balls": "0"
                            }
                        ]
                    },
                    {
                        "question": "Машин факультет Хорватса",
                        "id": "9",
                        "answers": [
                            {
                                "answer": "Гриффиндор",
                                "id": "1",
                                "balls": "2"
                            },
                            {
                                "answer": "Слизарин",
                                "id": "2",
                                "balls": "0"
                            },
                            {
                                "answer": "Коктевран",
                                "id": "3",
                                "balls": "0"
                            },
                            {
                                "answer": "Пуфиндуй",
                                "id": "4",
                                "balls": "10"
                            }
                        ]
                    },
                    {
                        "question": "Машина мечта",
                        "id": "10",
                        "answers": [
                            {
                                "answer": "Жить заграницей",
                                "id": "1",
                                "balls": "0"
                            },
                            {
                                "answer": "Купить квартиру",
                                "id": "2",
                                "balls": "10"
                            },
                            {
                                "answer": "Научиться водить машину",
                                "id": "3",
                                "balls": "0"
                            },
                            {
                                "answer": "Открыть свой бизнес",
                                "id": "4",
                                "balls": "0"
                            }
                        ]
                    }
                ],
                "results": [
                    {
                        "ballsStars": 100,
                        "ballsEnd": 100,
                        "title": "Если ты не Маша, то ты ее самый близкий человек!",
                        "text": "Круто, что ты так хорошо знаешь Машу, ей наверняка будет очень приятно, что такая сладкая булочка как ты есть в ее жизни! Она точно очень ценит тебя и будет ценить еще сильнее!",
                    },
                    {
                        "ballsStars": 80,
                        "ballsEnd": 99,
                        "title": "Круто, ты хорошо знаешь Машу! Ты, наверняка, её близкий человек!",
                        "text": "Ты отлично знаешь Машу! Конечно, есть куда стремиться, но не нужно идеально знать человека, чтобы быть ему близким другом. А ты, для Маши, точно таким являешься, если как хорошо прошел тест!",
                    },
                    {
                        "ballsStars": 50,
                        "ballsEnd": 79,
                        "title": "Ты хорошо знаешь Машу!",
                        "text": "Ты знаешь Машу больше чем на половину. Тебе еще есть куда стремиться, а это значит, что вам стоит чаще видиться и тусить вместе. Тогда, ты точно будешь знать Машу еще лучше, чем сейчас!",
                    },
                    {
                        "ballsStars": 10,
                        "ballsEnd": 49,
                        "title": "Ты не очень хорошо знаешь Машу",
                        "text": "Ты заешь Машу меньше чем на половину. Вам стоит срочно встретиться и исправить это досадное упущение! Ведь, если тебе дали этот тест, она считает тебя своим другом ;) ",
                    },
                    {
                        "ballsStars": 1,
                        "ballsEnd": 9,
                        "title": "Ты плохо знаешь Машу!",
                        "text": "Скорее, звони, пиши, зови гулять! Этот беспорядок нужно исправлять, ведь, если она дала тебе проходить этот тест - вы друзья! Значит вам стоит лучше узнать друг друга :)",
                    },
                    {
                        "ballsStars": 0,
                        "ballsEnd": 1,
                        "title": "Мы точно про одну и туже Машу говорили?",
                        "text": "Ты не только не знаешь Машу, ты еще и очень невезучий человек! Удача отвернулась от тебя и ты не угадал ответ ни на один вопрос! Тебе стоит чащу общаться с космосом, чтоб улучнить енергию везения, ну и с Машей, чтоб пройти этот тест хоть немного лучше!",
                    }
                ],
            },
            {
                "name": "Как хорошо ты знаешь 2?",
                "id": "2",
                "questions": [
                    {
                        "question": "Машин любимый цвет",
                        "id": "1",
                        "answers": [
                            {
                                "answer": "Желтый",
                                "id": "1",
                                "balls": "10"
                            },
                            {
                                "answer": "Зелёный",
                                "id": "2",
                                "balls": "0"
                            },
                            {
                                "answer": "Розовый",
                                "id": "3",
                                "balls": "0"
                            },
                            {
                                "answer": "Фиолетовый",
                                "id": "4",
                                "balls": "5"
                            }
                        ]
                    },
                    {
                        "question": "Машино любимое время года",
                        "id": "2",
                        "answers": [
                            {
                                "answer": "Зима",
                                "id": "1",
                                "balls": "0"
                            },
                            {
                                "answer": "Весна",
                                "id": "2",
                                "balls": "0"
                            },
                            {
                                "answer": "Лето",
                                "id": "3",
                                "balls": "10"
                            },
                            {
                                "answer": "Осень",
                                "id": "4",
                                "balls": "5"
                            }
                        ]
                    },
                    {
                        "question": "Машин любимый сериал",
                        "id": "3",
                        "answers": [
                            {
                                "answer": "Сверхъестественное ",
                                "id": "1",
                                "balls": "2"
                            },
                            {
                                "answer": "Сплетница",
                                "id": "2",
                                "balls": "10"
                            },
                            {
                                "answer": "Почему женщины убивают",
                                "id": "3",
                                "balls": "2"
                            },
                            {
                                "answer": "Майли Сайрус",
                                "id": "4",
                                "balls": "0"
                            }
                        ]
                    },
                    {
                        "question": "Машин любимый фастфуд",
                        "id": "4",
                        "answers": [
                            {
                                "answer": "Не люблю фастфуд",
                                "id": "1",
                                "balls": "0"
                            },
                            {
                                "answer": "McDonald’s",
                                "id": "2",
                                "balls": "10"
                            },
                            {
                                "answer": "KFC",
                                "id": "3",
                                "balls": "0"
                            },
                            {
                                "answer": "Пузата хата",
                                "id": "4",
                                "balls": "2"
                            }
                        ]
                    },
                    {
                        "question": "Машин любимый напиток",
                        "id": "5",
                        "answers": [
                            {
                                "answer": " Вода",
                                "id": "1",
                                "balls": "0"
                            },
                            {
                                "answer": "Мартинт",
                                "id": "2",
                                "balls": "3"
                            },
                            {
                                "answer": "Джин тоник",
                                "id": "3",
                                "balls": "10"
                            },
                            {
                                "answer": "Кофе",
                                "id": "4",
                                "balls": "0"
                            }
                        ]
                    },
                    {
                        "question": "Как Маша предпочла бы провести вечер?",
                        "id": "6",
                        "answers": [
                            {
                                "answer": "Дома смотреть сериал одной",
                                "id": "1",
                                "balls": "0"
                            },
                            {
                                "answer": "Сходить в ресторан с любимым",
                                "id": "2",
                                "balls": "3"
                            },
                            {
                                "answer": "Пойти в караоке с друзьями",
                                "id": "3",
                                "balls": "10"
                            },
                            {
                                "answer": "Спать",
                                "id": "4",
                                "balls": "2"
                            }
                        ]
                    },
                    {
                        "question": "Какую супер способность Маша хотела бы?",
                        "id": "7",
                        "answers": [
                            {
                                "answer": "Невидимость",
                                "id": "1",
                                "balls": "0"
                            },
                            {
                                "answer": "Летать",
                                "id": "2",
                                "balls": "2"
                            },
                            {
                                "answer": "Читать мысли",
                                "id": "3",
                                "balls": "10"
                            },
                            {
                                "answer": "Теликинез",
                                "id": "4",
                                "balls": "3"
                            }
                        ]
                    },
                    {
                        "question": "От чего Маша точно не откажется с тобой?",
                        "id": "8",
                        "answers": [
                            {
                                "answer": "Заказать еды и пить сидрик",
                                "id": "1",
                                "balls": "5"
                            },
                            {
                                "answer": "Заняться вместе утренним пробежками",
                                "id": "2",
                                "balls": "2"
                            },
                            {
                                "answer": "Нарядиться и пойти покарять бары города",
                                "id": "3",
                                "balls": "10"
                            },
                            {
                                "answer": "Я во всем тебе откажу, я похожа на общительного человека?",
                                "id": "4",
                                "balls": "0"
                            }
                        ]
                    },
                    {
                        "question": "Машин факультет Хорватса",
                        "id": "9",
                        "answers": [
                            {
                                "answer": "Гриффиндор",
                                "id": "1",
                                "balls": "2"
                            },
                            {
                                "answer": "Слизарин",
                                "id": "2",
                                "balls": "0"
                            },
                            {
                                "answer": "Коктевран",
                                "id": "3",
                                "balls": "0"
                            },
                            {
                                "answer": "Пуфиндуй",
                                "id": "4",
                                "balls": "10"
                            }
                        ]
                    },
                    {
                        "question": "Машина мечта",
                        "id": "10",
                        "answers": [
                            {
                                "answer": "Жить заграницей",
                                "id": "1",
                                "balls": "0"
                            },
                            {
                                "answer": "Купить квартиру",
                                "id": "2",
                                "balls": "10"
                            },
                            {
                                "answer": "Научиться водить машину",
                                "id": "3",
                                "balls": "0"
                            },
                            {
                                "answer": "Открыть свой бизнес",
                                "id": "4",
                                "balls": "0"
                            }
                        ]
                    }
                ],
                "results": [
                    {
                        "ballsStars": 100,
                        "ballsEnd": 100,
                        "title": "Если ты не Маша, то ты ее самый близкий человек!",
                        "text": "Круто, что ты так хорошо знаешь Машу, ей наверняка будет очень приятно, что такая сладкая булочка как ты есть в ее жизни! Она точно очень ценит тебя и будет ценить еще сильнее!",
                    },
                    {
                        "ballsStars": 80,
                        "ballsEnd": 99,
                        "title": "Круто, ты хорошо знаешь Машу! Ты, наверняка, её близкий человек!",
                        "text": "Ты отлично знаешь Машу! Конечно, есть куда стремиться, но не нужно идеально знать человека, чтобы быть ему близким другом. А ты, для Маши, точно таким являешься, если как хорошо прошел тест!",
                    },
                    {
                        "ballsStars": 50,
                        "ballsEnd": 79,
                        "title": "Ты хорошо знаешь Машу!",
                        "text": "Ты знаешь Машу больше чем на половину. Тебе еще есть куда стремиться, а это значит, что вам стоит чаще видиться и тусить вместе. Тогда, ты точно будешь знать Машу еще лучше, чем сейчас!",
                    },
                    {
                        "ballsStars": 10,
                        "ballsEnd": 49,
                        "title": "Ты не очень хорошо знаешь Машу",
                        "text": "Ты заешь Машу меньше чем на половину. Вам стоит срочно встретиться и исправить это досадное упущение! Ведь, если тебе дали этот тест, она считает тебя своим другом ;) ",
                    },
                    {
                        "ballsStars": 1,
                        "ballsEnd": 9,
                        "title": "Ты плохо знаешь Машу!",
                        "text": "Скорее, звони, пиши, зови гулять! Этот беспорядок нужно исправлять, ведь, если она дала тебе проходить этот тест - вы друзья! Значит вам стоит лучше узнать друг друга :)",
                    },
                    {
                        "ballsStars": 0,
                        "ballsEnd": 1,
                        "title": "Мы точно про одну и туже Машу говорили?",
                        "text": "Ты не только не знаешь Машу, ты еще и очень невезучий человек! Удача отвернулась от тебя и ты не угадал ответ ни на один вопрос! Тебе стоит чащу общаться с космосом, чтоб улучнить енергию везения, ну и с Машей, чтоб пройти этот тест хоть немного лучше!",
                    }
                ],
            },
            {
                "name": "Как хорошо ты знаешь 3?",
                "id": "3",
                "questions": [
                    {
                        "question": "Машин любимый цвет",
                        "id": "1",
                        "answers": [
                            {
                                "answer": "Желтый",
                                "id": "1",
                                "balls": "10"
                            },
                            {
                                "answer": "Зелёный",
                                "id": "2",
                                "balls": "0"
                            },
                            {
                                "answer": "Розовый",
                                "id": "3",
                                "balls": "0"
                            },
                            {
                                "answer": "Фиолетовый",
                                "id": "4",
                                "balls": "5"
                            }
                        ]
                    },
                    {
                        "question": "Машино любимое время года",
                        "id": "2",
                        "answers": [
                            {
                                "answer": "Зима",
                                "id": "1",
                                "balls": "0"
                            },
                            {
                                "answer": "Весна",
                                "id": "2",
                                "balls": "0"
                            },
                            {
                                "answer": "Лето",
                                "id": "3",
                                "balls": "10"
                            },
                            {
                                "answer": "Осень",
                                "id": "4",
                                "balls": "5"
                            }
                        ]
                    },
                    {
                        "question": "Машин любимый сериал",
                        "id": "3",
                        "answers": [
                            {
                                "answer": "Сверхъестественное ",
                                "id": "1",
                                "balls": "2"
                            },
                            {
                                "answer": "Сплетница",
                                "id": "2",
                                "balls": "10"
                            },
                            {
                                "answer": "Почему женщины убивают",
                                "id": "3",
                                "balls": "2"
                            },
                            {
                                "answer": "Майли Сайрус",
                                "id": "4",
                                "balls": "0"
                            }
                        ]
                    },
                    {
                        "question": "Машин любимый фастфуд",
                        "id": "4",
                        "answers": [
                            {
                                "answer": "Не люблю фастфуд",
                                "id": "1",
                                "balls": "0"
                            },
                            {
                                "answer": "McDonald’s",
                                "id": "2",
                                "balls": "10"
                            },
                            {
                                "answer": "KFC",
                                "id": "3",
                                "balls": "0"
                            },
                            {
                                "answer": "Пузата хата",
                                "id": "4",
                                "balls": "2"
                            }
                        ]
                    },
                    {
                        "question": "Машин любимый напиток",
                        "id": "5",
                        "answers": [
                            {
                                "answer": " Вода",
                                "id": "1",
                                "balls": "0"
                            },
                            {
                                "answer": "Мартинт",
                                "id": "2",
                                "balls": "3"
                            },
                            {
                                "answer": "Джин тоник",
                                "id": "3",
                                "balls": "10"
                            },
                            {
                                "answer": "Кофе",
                                "id": "4",
                                "balls": "0"
                            }
                        ]
                    },
                    {
                        "question": "Как Маша предпочла бы провести вечер?",
                        "id": "6",
                        "answers": [
                            {
                                "answer": "Дома смотреть сериал одной",
                                "id": "1",
                                "balls": "0"
                            },
                            {
                                "answer": "Сходить в ресторан с любимым",
                                "id": "2",
                                "balls": "3"
                            },
                            {
                                "answer": "Пойти в караоке с друзьями",
                                "id": "3",
                                "balls": "10"
                            },
                            {
                                "answer": "Спать",
                                "id": "4",
                                "balls": "2"
                            }
                        ]
                    },
                    {
                        "question": "Какую супер способность Маша хотела бы?",
                        "id": "7",
                        "answers": [
                            {
                                "answer": "Невидимость",
                                "id": "1",
                                "balls": "0"
                            },
                            {
                                "answer": "Летать",
                                "id": "2",
                                "balls": "2"
                            },
                            {
                                "answer": "Читать мысли",
                                "id": "3",
                                "balls": "10"
                            },
                            {
                                "answer": "Теликинез",
                                "id": "4",
                                "balls": "3"
                            }
                        ]
                    },
                    {
                        "question": "От чего Маша точно не откажется с тобой?",
                        "id": "8",
                        "answers": [
                            {
                                "answer": "Заказать еды и пить сидрик",
                                "id": "1",
                                "balls": "5"
                            },
                            {
                                "answer": "Заняться вместе утренним пробежками",
                                "id": "2",
                                "balls": "2"
                            },
                            {
                                "answer": "Нарядиться и пойти покарять бары города",
                                "id": "3",
                                "balls": "10"
                            },
                            {
                                "answer": "Я во всем тебе откажу, я похожа на общительного человека?",
                                "id": "4",
                                "balls": "0"
                            }
                        ]
                    },
                    {
                        "question": "Машин факультет Хорватса",
                        "id": "9",
                        "answers": [
                            {
                                "answer": "Гриффиндор",
                                "id": "1",
                                "balls": "2"
                            },
                            {
                                "answer": "Слизарин",
                                "id": "2",
                                "balls": "0"
                            },
                            {
                                "answer": "Коктевран",
                                "id": "3",
                                "balls": "0"
                            },
                            {
                                "answer": "Пуфиндуй",
                                "id": "4",
                                "balls": "10"
                            }
                        ]
                    },
                    {
                        "question": "Машина мечта",
                        "id": "10",
                        "answers": [
                            {
                                "answer": "Жить заграницей",
                                "id": "1",
                                "balls": "0"
                            },
                            {
                                "answer": "Купить квартиру",
                                "id": "2",
                                "balls": "10"
                            },
                            {
                                "answer": "Научиться водить машину",
                                "id": "3",
                                "balls": "0"
                            },
                            {
                                "answer": "Открыть свой бизнес",
                                "id": "4",
                                "balls": "0"
                            }
                        ]
                    }
                ],
                "results": [
                    {
                        "ballsStars": 100,
                        "ballsEnd": 100,
                        "title": "Если ты не Маша, то ты ее самый близкий человек!",
                        "text": "Круто, что ты так хорошо знаешь Машу, ей наверняка будет очень приятно, что такая сладкая булочка как ты есть в ее жизни! Она точно очень ценит тебя и будет ценить еще сильнее!",
                    },
                    {
                        "ballsStars": 80,
                        "ballsEnd": 99,
                        "title": "Круто, ты хорошо знаешь Машу! Ты, наверняка, её близкий человек!",
                        "text": "Ты отлично знаешь Машу! Конечно, есть куда стремиться, но не нужно идеально знать человека, чтобы быть ему близким другом. А ты, для Маши, точно таким являешься, если как хорошо прошел тест!",
                    },
                    {
                        "ballsStars": 50,
                        "ballsEnd": 79,
                        "title": "Ты хорошо знаешь Машу!",
                        "text": "Ты знаешь Машу больше чем на половину. Тебе еще есть куда стремиться, а это значит, что вам стоит чаще видиться и тусить вместе. Тогда, ты точно будешь знать Машу еще лучше, чем сейчас!",
                    },
                    {
                        "ballsStars": 10,
                        "ballsEnd": 49,
                        "title": "Ты не очень хорошо знаешь Машу",
                        "text": "Ты заешь Машу меньше чем на половину. Вам стоит срочно встретиться и исправить это досадное упущение! Ведь, если тебе дали этот тест, она считает тебя своим другом ;) ",
                    },
                    {
                        "ballsStars": 1,
                        "ballsEnd": 9,
                        "title": "Ты плохо знаешь Машу!",
                        "text": "Скорее, звони, пиши, зови гулять! Этот беспорядок нужно исправлять, ведь, если она дала тебе проходить этот тест - вы друзья! Значит вам стоит лучше узнать друг друга :)",
                    },
                    {
                        "ballsStars": 0,
                        "ballsEnd": 1,
                        "title": "Мы точно про одну и туже Машу говорили?",
                        "text": "Ты не только не знаешь Машу, ты еще и очень невезучий человек! Удача отвернулась от тебя и ты не угадал ответ ни на один вопрос! Тебе стоит чащу общаться с космосом, чтоб улучнить енергию везения, ну и с Машей, чтоб пройти этот тест хоть немного лучше!",
                    }
                ],
            },
        ]
    },
    getters : {
        tests(state) {
            return state.tests
        }
    }
}
